
def hello(user_id):
    Hello_message = f"☀️ *Приветствую тебя, {user_id}, в мастерской для gambling креативщиков!*\n\nЗдесь ты можешь сэкономить свое время(=деньги)."
    return Hello_message
    # return "Hello message"

def about():
    first = "🥰<b>Сервис был создан, потому что я сам на своем пути убил кучу времени и нервов, ища материалы.</b>"
    third = "<b>Links:</b>\n@KreativshikNoet — Мой блог о технических аспектах креосов\n@i_Creo — Канал с моими и не только креативами\n@DeFaustus — Второй аккаунт (Support)"
    fourth = "🔥 <b>Всегда ищу талантливых креативщиков и проггеров</b>"

    final = f"{first}\n\n{third}\n\n{fourth}"
    return final
    # return "About Text"

def AboutMe():
    first = "<b>Who is @Me4tatelnitca?</b>"
    second = "<b>17 летний мальчик из Приднестровья, который гордится креативщиками, как своими детьми родители</b>\n*Кстати если вы тоже из этой необъятной, свяжитесь со мной, пообщаемся вживую за креосы, арбитраж, маркетинг туда-сюда 🤝\nНа этом все."


    return f"{first}\n\n{second}"

def Ecosystem():
    first = '<b>🤨iCreo Health — Колыбель креативщика</b>'
    second = '<b>Я считаю, что каждый креативщик, должен иметь:</b>\n— Право на своё имя\n— Иметь место для поддержки\n— Знать, что ему помогут\n— Иметь место для саморазвития и повышения квалификации'
    third = ''
    fourth = '<b>Внимание: Я ориентирован на малоизвестных в своей сфере, поэтому те, кто уже добился вершин, у вас все успешно, продолжайте🔥🔥🔥!</b>'
    fifth = '🫣 Обращайтесь в личку, всем профита.\n<b>Всегда ваш,</b> @Me4tatelnitca'

    final = f"{first}\n\n{second}{third}\n\n{fourth}\n\n{fifth}"
    return final

def FAQ():
    first = "👋_FAQ:\nВ данном боте возможна покупка полного пака слота почти любого провайдера (постоянно обновляем базу)_"
    second = "*Что такое полный пак?*\n— Это Анимационные элементы (Куда больше чем-ты думаешь) 🫣\n— Это Статичные промты\n— Это Весь Саунд слота, от бэкграунда до reel\_Stop\n— Это Возможность использовать шрифты из самого слота"
    fourth = "✍️ *Если не нашли нужный слот или провайдера — обращайтесь в ПМ: @Me4tatelnitca*"

    final = f"{first}\n\n{second}\n\n{fourth}"
    return final
    # return "FAQ"

def InfoProfile(id, name):

    
    first = f"*☀️ Доброго, {name}, ты пользуешься кайфовым ботом поэтому:*"
    five = "Благодарю за все ❤️"

    final = f"{first}\n\n{five}\n\n@Me4tatelnitca <-- Если понадоблюсь\n@DeFaustus <-- По вопросам Бота (Саппорт)"
    return final
    # return "InfoProfile"
